In [67]:
import pandas as pd
import numpy as np

In [68]:
data=pd.Series(['서울','부산','구미'])
data

0    서울
1    부산
2    구미
dtype: object

In [69]:
data=pd.Series(np.array(['서울','부산','구미'])) # 넘파이 어레이랑 판다스 시리즈랑 같이 작동함
data

0    서울
1    부산
2    구미
dtype: object

In [70]:
data=pd.Series(['서울','부산','구미'])
data

0    서울
1    부산
2    구미
dtype: object

In [71]:
# 딕셔너리로 만들어보기
data=pd.Series({"서울":1, "부산":2, "구미":3})
data

서울    1
부산    2
구미    3
dtype: int64

In [72]:
data.info()

<class 'pandas.core.series.Series'>
Index: 3 entries, 서울 to 구미
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      int64
dtypes: int64(1)
memory usage: 156.0+ bytes

In [73]:
data=pd.Series([1, 2, 3])
data.info()

<class 'pandas.core.series.Series'>
RangeIndex: 3 entries, 0 to 2
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      int64
dtypes: int64(1)
memory usage: 152.0 bytes

### 1. 인덱스와 value 확인하는 방법

In [74]:
data2 = pd.Series([4, 5, 6])
print(data2)
print("인덱스는", data2.index)
print("밸류는", data2.values)

0    4
1    5
2    6
dtype: int64
인덱스는 RangeIndex(start=0, stop=3, step=1)
밸류는 [4 5 6]

### 결측치 채우는 방법

In [75]:
data1 = pd.Series([1,2,3], index=['강남','노원','서초'])
data2 = pd.Series([1,2,3], index=['강남','노원','동작'])
total_data = data1+ data2
print(total_data)

강남    2.0
노원    4.0
동작    NaN
서초    NaN
dtype: float64

In [76]:
total_data.fillna(0)

강남    2.0
노원    4.0
동작    0.0
서초    0.0
dtype: float64

In [77]:
total_data

강남    2.0
노원    4.0
동작    NaN
서초    NaN
dtype: float64

In [78]:
result = total_data.fillna(0)

In [79]:
result

강남    2.0
노원    4.0
동작    0.0
서초    0.0
dtype: float64

In [80]:
result = total_data.dropna()

In [81]:
result

강남    2.0
노원    4.0
dtype: float64

### 시리즈 통계
 - 평균
 - 분산
 - 표준편차

 - 최솟값
 - 1/4분위수
 - 2/4분위수
 - 3/4분위수
 - 최댓값

In [82]:
data=pd.Series([10,20,30,40,50])
data.describe()

count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
dtype: float64

### 데이터 프레임 만들어보기

In [83]:
df = pd.DataFrame({"깅님구": [1,2,3],
                   "영등포구":[4,5,6],
                   "신평동":[7,8,9]})

In [84]:
df # 칼럼명 : 강남구, 영등포구, 신평동

   깅님구  영등포구  신평동
0    1     4    7
1    2     5    8
2    3     6    9

In [85]:
df['영등포구']

0    4
1    5
2    6
Name: 영등포구, dtype: int64

In [86]:
df.index =["1월", "2월", "3월"]

In [87]:
df

    깅님구  영등포구  신평동
1월    1     4    7
2월    2     5    8
3월    3     6    9

In [88]:
df.columns=["강남구","영등포구", "신평구"]

In [89]:
df

    강남구  영등포구  신평구
1월    1     4    7
2월    2     5    8
3월    3     6    9

In [90]:
# 인덱스와 컬럼명으로 조히하는 방법 - 칼럼으로 조회할때는 [칼럼명], index로 조회할 때는 iloc를 사용

print(df["강남구"].iloc[1])

2

In [91]:
df=df.rename(columns={"신평구":"신평동"})# 원본데이터는 바뀌지 않으므로

In [92]:
# 인덱스 초기화
df.reset_index(drop=True)

   강남구  영등포구  신평동
0    1     4    7
1    2     5    8
2    3     6    9

In [93]:
# 데이터 조회하기
df[["강남구","영등포구"]]

    강남구  영등포구
1월    1     4
2월    2     5
3월    3     6

In [94]:
df.loc[[0,2]]

KeyError: "None of [Index([0, 2], dtype='int64')] are in the [index]"

In [ ]:
df.iloc[1:]

    강남구  영등포구  신평동
2월    2     5    8
3월    3     6    9

In [ ]:
df.loc[["강남구","영등포구"]]

KeyError: "None of [Index(['강남구', '영등포구'], dtype='object')] are in the [index]"

### 데이터 분석과정
 1. 데이터 불러오기
 2. 데이터 확인한 후
 3. 데이터 정제

In [ ]:
# 1. 데이터 불러오기
df =pd.read_csv("cdata_nan.csv",)
df

   index   이름    나이   지역
0      1  홍길동  25.0   서울
1      2  김준기   NaN   서울
2      9  이명식  22.0  NaN
3     32  방준혁   NaN   광주
4     47  최명기  31.0   부산

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   index   5 non-null      int64
 1   이름      5 non-null      object
 2   나이      3 non-null      float64
 3   지역      4 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 288.0+ bytes

In [ ]:
df.describe()

           index         나이
count   5.000000   3.000000
mean   18.200000  26.000000
std    20.388722   4.582576
min     1.000000  22.000000
25%     2.000000  23.500000
50%     9.000000  25.000000
75%    32.000000  28.000000
max    47.000000  31.000000

In [ ]:
df.head()

   index   이름    나이   지역
0      1  홍길동  25.0   서울
1      2  김준기   NaN   서울
2      9  이명식  22.0  NaN
3     32  방준혁   NaN   광주
4     47  최명기  31.0   부산

In [ ]:
df.tail()

   index   이름    나이   지역
0      1  홍길동  25.0   서울
1      2  김준기   NaN   서울
2      9  이명식  22.0  NaN
3     32  방준혁   NaN   광주
4     47  최명기  31.0   부산

In [ ]:
# 데이터를 확인해봤더니, 결측치가 있다.
# 나이. 지역에 결측치가 있다
# 나이 ->
# 지역 ->

In [ ]:
df.isnull()

   index     이름     나이     지역
0  False  False  False  False
1  False  False   True  False
2  False  False  False   True
3  False  False   True  False
4  False  False  False  False

In [ ]:
# 결측치를 제거
df_drop=df. dropna()
df_drop

   index   이름    나이  지역
0      1  홍길동  25.0  서울
4     47  최명기  31.0  부산

In [ ]:
df['나이']=df['나이'].fillna(26)

In [ ]:
df

   index   이름    나이   지역
0      1  홍길동  25.0   서울
1      2  김준기  26.0   서울
2      9  이명식  22.0  NaN
3     32  방준혁  26.0   광주
4     47  최명기  31.0   부산

In [ ]:
# 지역 칼럼 -> 최반값으로 채우기 : 빈도우삭 제일 높은 값
df['지역']=df['지역'].fillna("서울")
df

   index   이름    나이  지역
0      1  홍길동  25.0  서울
1      2  김준기  26.0  서울
2      9  이명식  22.0  서울
3     32  방준혁  26.0  광주
4     47  최명기  31.0  부산

### 다른원본 데이터 가저오기

In [ ]:
df=pd.read_csv("cdata_nohead.csv",
               header=None,
               names=['이름', '나이', '지역']
               )
df

     이름  나이  지역
1   홍길동  25  서울
2   김준기  21  서울
9   이명식  22  부산
32  방준혁  24  광주
47  최명기  31  부산

In [64]:
# 나이순으로 오름차순으로 정렬
df=df.sort_values(by="나이")
df

     이름  나이  지역
2   김준기  21  서울
9   이명식  22  부산
32  방준혁  24  광주
1   홍길동  25  서울
47  최명기  31  부산

In [ ]:
df.sort_index()

     이름  나이  지역
1   홍길동  25  서울
2   김준기  21  서울
9   이명식  22  부산
32  방준혁  24  광주
47  최명기  31  부산

In [95]:
# 나이순으로 내림차순 정렬
df=df.sort_values(by="나이", ascending=False)

KeyError: '나이'

In [96]:
# 컬러명ㅇ으로 정렬
df.sort_index(axis=1)

    강남구  신평동  영등포구
1월    1    7     4
2월    2    8     5
3월    3    9     6